app/controllers/items_controller.rb

  def create
  	# get the item information from the parameters
  	item_name = params[:name]
  	needed = params[:needed]
  	image = params[:image]
  	description = params[:description]

  	newItem = RegistryItem.new(name: item_name,needed: needed, pledged: 0, picture: image, description: description)
  	newItem.save
---
INSERT INTO "registry_items" ("name", "needed", "pledged", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test1"], ["needed", 8], ["pledged", 0], ["created_at", 2016-12-30 15:19:27 UTC], ["updated_at", 2016-12-30 15:19:27 UTC], ["description", "This is a test"]]

  def delete
  	id = params[:id]
	item = RegistryItem.find(id)
	item.delete()
---
SELECT  "registry_items".* FROM "registry_items" WHERE "registry_items"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "registry_items" WHERE "registry_items"."id" = ?  [["id", 18]]