app/controllers/items_controller.rb

  def index
    selectedCategory = params[:selection]
    @categories = Category.all
---
SELECT "categories".* FROM "categories"