app/controllers/manage_controller.rb

  def index
  	selection = params[:selection]
  	if selection.nil?
	  	@items = RegistryItem.all
---
SELECT "registry_items".* FROM "registry_items"